// 영화정보객체 JS : JS4-1.배열과객체_object.JS

// 수희객체
var SuheeObj = {
  // 1. 영화제목
  제목: "상견니",
  // 2. 감독
  감독: "황천인",
  // 3. 배우
  배우: "가가연, 허광한, 시뱅우",
  // 4. 장르
  장르: "드라마, 판타지, 멜로/로맨스",
  // 5. 관람가
  관람가: "15세 관람가",
  // 6. 에고편
  예고편: function () {
    // 1. 호출확인
    // alert("예고편");

    // 플레이함수 호출
    playMv("x5VeuRo4JDw");
  }, // 예고편 메서드
}; //SuheeObj 객체

// 유정객체
var aladdin = {
  // 1.영화제목
  제목: "알라딘",
  // 2.감독
  감독: "가이 리치",
  // 3.배우
  배우: "메나 마수드, 윌 스미스, 나오미 스콧",
  // 4.장르
  장르: "모험",
  // 5.관람가
  관람가: "전체 관람가",
  // 6.예고편 (메서드 만들거라 중요)
  예고편: function () {
    // 1.호출확인
    // alert("예고편");

    // 플레이 함수 호출하기
    playMv("KrM3vS5sy2w");
  }, //////////////// 예고편 상영 메서드 끝 ////////////////
}; ///////////////////// aladdin 객체 //////////////////////

// 성해객체
var shObj = {
  // 1. 영화제목
  제목: "스위치",

  // 2. 감독
  감독: "마대윤",

  // 3. 배우
  배우: "권상우,오정세",

  // 4. 장르
  장르: "로맨스코미디",

  // 5. 관람가
  관람가: "12세 관람가",

  // 6. 예고편
  예고편: function () {
    // 1. 호출확인
    // alert("예고편");

    // 플레이함수 호출
    playMv("O_b5ZuETlCY");
  }, //// 예고편 메서드 /////
}; /////////////////// shObj 객체 ////////////////\

// 수진객체
var mvtxt = {
  // 1. 영화제목
  제목: "올빼미/",
  // 2. 감독
  감독: "안태진/",
  // 3. 배우
  배우: "류준열, 유해진/",
  // 4. 장르
  장르: "스릴러/",
  // 5. 관람가
  관람가: "15세 관람가",
  // 6. 예고편
  예고편: function () {
    // 1. 호출확인
    // alert("예고편");

    // 플레이함수 호출
    playMv("eRX5_KUyx7c");
  }, ///// 예고편 메서드 ////
}; ///////////// mvtxt 객체 //////////////

// 민경객체
var mkObj = {
  // 1. 영화제목
  제목: "영웅",
  // 2. 감독
  감독: "윤제균",
  // 3. 배우
  배우: "정성화, 김고은, 나문희",
  // 4. 장르
  장르: "드라마",
  // 5. 관람가
  관람가: "12세 관람가",
  // 6. 예고편
  예고편: function () {
    // 1. 호출확인
    // alert("예고편");

    // 플레이함수 호출
    playMv("K4KR4J-yBMw");
  }, ///예고편 메서드////
}; ////mkObj 객체////
